{
  "backend/main.mo": "Defines the main game canister with user profiles, lobbies, challenges, match results, authorization checks, and lobby creation logic.",
  "backend/migration.mo": "Migration module that maps the old actor state to the new actor format with no transformations.",
  "feature_evidence.json": "Feature evidence report linking features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of multiple frontend files describing UI, routing, hooks, and terminal-themed components.",
  "frontend/index.css": "Tailwind-based global CSS defining color tokens and themes for light and dark modes.",
  "frontend/index.html": "Basic HTML entrypoint loading the main React application.",
  "frontend/public/google79d2180f87c8c2c7.html": "Google site verification HTML file.",
  "frontend/src/App.tsx": "Configures the React Router routes and wraps the app with theme provider and shared layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Authentication button handling Internet Identity login/logout with loading and error handling.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to enter and save a display name.",
  "frontend/src/components/game/RoundTimer.tsx": "Countdown timer component showing remaining time with urgency styling.",
  "frontend/src/components/game/Scoreboard.tsx": "Displays lobby players with host identification in a terminal-styled list.",
  "frontend/src/components/game/TerminalPanel.tsx": "Interactive terminal UI handling command input, history, autocomplete, and output rendering for challenges.",
  "frontend/src/components/layout/AppLayout.tsx": "Main app layout with header, navigation, footer, and container styling.",
  "frontend/src/constants/appVersion.ts": "Exports the global application version string.",
  "frontend/src/content/updates.ts": "Provides changelog entries for the Updates page as static data.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance, refreshing it on identity changes.",
  "frontend/src/hooks/useActorReady.ts": "Wrapper hook exposing whether the actor is ready for use.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity auth state, login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user profiles, lobbies, matches, and terminal command processing.",
  "frontend/src/index.css": "Tailwind-based global styles defining terminal-themed colors, effects, and utility classes.",
  "frontend/src/main.tsx": "Application entry point initializing React, query client, and identity provider.",
  "frontend/src/pages/HomePage.tsx": "Landing page with hero text, solo mode navigation, and multiplayer lobby creation with error handling.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays global leaderboard and recent matches with authentication-aware notices and loading states.",
  "frontend/src/pages/LobbyPage.tsx": "Shows lobby details, handles joining, leaving, starting matches, copying lobby codes, and auto-refreshing lobby state.",
  "frontend/src/pages/MatchPage.tsx": "Runs an active match with command processing, challenge display, timers, scoreboards, and error feedback.",
  "frontend/src/pages/ResultsPage.tsx": "Shows final score and mode after a match with options to play again or return home.",
  "frontend/src/pages/SoloGamePage.tsx": "Manages solo-game initialization, polling for lobby readiness, processing commands, and tracking score and state.",
  "frontend/src/pages/UpdatesPage.tsx": "Renders the Updates page showing app version and a styled list of update entries with dates and change logs.",
  "frontend/src/utils/parseIcError.ts": "Converts various IC and backend error messages into user-friendly strings, handling common canister, auth, lobby, and network issues.",
  "frontend/src/utils/unwrapCandidOptional.ts": "Utility to unwrap Candid optional tuple-array values, returning the inner value or null.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with session persistence and hash-routing support.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the project's retro terminal aesthetic.",
  "project_state.json": "Contains the project’s current state, requirements, issues, and architectural notes for build planning."
}