{
  "backend/main.mo": "Defines game types, user profiles, lobbies, authorization checks, and functions for profile management and lobby creation with access control enforcement.",
  "feature_evidence.json": "Documents evidence for implementing Google Search Console verification via a specific static HTML file.",
  "frontend-file-summaries.txt": "Contains prewritten summaries of various frontend source files for reference or build tooling.",
  "frontend/index.css": "Applies Tailwind layers and defines extensive light/dark theme CSS variables for color tokens and UI styling.",
  "frontend/index.html": "Base HTML entry point that mounts the React app and loads the main TypeScript module.",
  "frontend/public/google79d2180f87c8c2c7.html": "Static file containing the Google Search Console verification string.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes and wraps the application with the theme provider and layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Renders an Internet Identity login/logout button with loading states and query cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Shows a modal for first-time users to set a display name and saves the profile to the backend.",
  "frontend/src/components/game/RoundTimer.tsx": "Displays a countdown timer based on a start time and duration, updating every second with urgency styling.",
  "frontend/src/components/game/Scoreboard.tsx": "Shows the list of players in a lobby with host indication in a styled terminal-themed panel.",
  "frontend/src/components/game/TerminalPanel.tsx": "Implements an interactive terminal UI with command history, autocomplete, and output rendering for game challenges.",
  "frontend/src/components/layout/AppLayout.tsx": "Defines the main application layout with header, navigation, footer, and themed styling.",
  "frontend/src/constants/appVersion.ts": "Exports the application's version string as a shared constant.",
  "frontend/src/content/updates.ts": "Provides structured changelog data for the Updates page.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor instance tied to Internet Identity and handles query invalidation on change.",
  "frontend/src/hooks/useActorReady.ts": "Wraps useActor to expose a simple readiness flag for the actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context and provider with login, logout, and stored identity handling.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend interactions including profiles, lobbies, matches, and command processing with a simulation fallback.",
  "frontend/src/index.css": "Contains Tailwind-based global styles and custom terminal-inspired theme effects.",
  "frontend/src/main.tsx": "Bootstraps the React app with query and identity providers applied.",
  "frontend/src/pages/HomePage.tsx": "Renders the home screen with solo and multiplayer options, handles lobby creation, and displays feature highlights.",
  "frontend/src/pages/LeaderboardPage.tsx": "Fetches and displays the global leaderboard and recent matches, with optional authentication prompts.",
  "frontend/src/pages/LobbyPage.tsx": "Manages lobby state including joining, leaving, starting matches, copying lobby codes, and polling lobby updates.",
  "frontend/src/pages/MatchPage.tsx": "Runs the active match view, processes terminal commands, tracks completion, and redirects to results when finished.",
  "frontend/src/pages/ResultsPage.tsx": "Shows final score and mode after a match and provides navigation back to solo mode or the main menu.",
  "frontend/src/pages/SoloGamePage.tsx": "Initializes and runs a solo match by creating a lobby, starting the game, handling commands, and computing score.",
  "frontend/src/pages/UpdatesPage.tsx": "Renders the updates log page, listing versioned updates with titles, dates, and change details using a styled terminal-like UI.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL and session-based parameters, including hash-based routing support.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, animations, and plugins for the app’s terminal-style theme.",
  "project_state.json": "Describes the project's current state, features, issues, and architectural notes for the hacking‑style game."
}