{
  "backend/main.mo": "Defines game backend actor with user profiles, lobbies, match results, authorization checks, and lobby creation logic for solo and multiplayer modes.",
  "feature_evidence.json": "Lists feature evidence entries describing Solo-mode latency improvements and initialization UX updates, mapping them to affected frontend files and components.",
  "frontend-file-summaries.txt": "Provides prewritten short summaries for numerous frontend files describing styling, routing, UI components, hooks, and game page behaviors.",
  "frontend/index.css": "Sets global Tailwind layers and OKLCH color variables for light/dark themes with shared base styling.",
  "frontend/index.html": "Root HTML file that loads the React app via main.tsx.",
  "frontend/public/google79d2180f87c8c2c7.html": "Google site‑verification file for domain validation.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app in a themed layout with all game pages registered.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button using Internet Identity with loading states and cache clearing on logout.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting new authenticated users to set a hacker alias and save their profile.",
  "frontend/src/components/game/RoundTimer.tsx": "Countdown timer that computes remaining time from a start timestamp and displays urgency color changes.",
  "frontend/src/components/game/Scoreboard.tsx": "Displays lobby players with host indicator in a terminal‑styled panel.",
  "frontend/src/components/game/TerminalPanel.tsx": "Renders an interactive terminal UI with command history, autocomplete, and output handling for challenge commands.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header, navigation, footer, and version display.",
  "frontend/src/constants/appVersion.ts": "Exports the centralized application version string.",
  "frontend/src/content/updates.ts": "Defines structured changelog entries for the Updates page.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useActorReady.ts": "Wraps useActor to provide a simple readiness flag for actor availability.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, login, logout, and identity persistence.",
  "frontend/src/hooks/useLobbyAutoJoin.ts": "Handles auto-joining multiplayer lobbies and exposes join status, errors, and retry logic.",
  "frontend/src/hooks/useQueries.ts": "Provides React Query hooks for backend interactions including profiles, lobbies, matches, and command processing.",
  "frontend/src/index.css": "Defines Tailwind layers and a retro terminal theme with color variables and custom effects like scanlines and CRT textures.",
  "frontend/src/main.tsx": "Bootstraps the React app, providing React Query and Internet Identity context before rendering App.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with solo and multiplayer options, lobby creation, authentication checks, and error handling.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays global leaderboard and recent matches with loading states, authentication notice, and styled terminal UI.",
  "frontend/src/pages/LobbyPage.tsx": "Shows lobby details, handles auto-join, match start, leaving, invite copying, and polls lobby status.",
  "frontend/src/pages/MatchPage.tsx": "Runs an active match with command processing, challenge display, auto-join handling, and redirects to results on completion.",
  "frontend/src/pages/ResultsPage.tsx": "Shows final score and mode after a match, with options to replay or return to the main menu.",
  "frontend/src/pages/SoloGamePage.tsx": "Implements solo game flow with lobby creation, match start, resilient readiness polling, and initialization timers.",
  "frontend/src/pages/UpdatesPage.tsx": "Renders a styled updates log showing version history, changes, and metadata.",
  "frontend/src/utils/parseIcError.ts": "Converts IC and backend errors into user-friendly messages, handling many specific error patterns.",
  "frontend/src/utils/soloInitProgress.ts": "Provides solo-mode initialization phases, timeout logic, and elapsed-time formatting.",
  "frontend/src/utils/soloReadiness.ts": "Supplies lobby readiness checks and retry/backoff utilities for polling readiness.",
  "frontend/src/utils/unwrapCandidOptional.ts": "Unwraps Candid optional tuple-array values into plain values or null.",
  "frontend/src/utils/urlParams.ts": "Handles URL parameter extraction, session persistence, and safe cleanup of hash params.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, animations, and plugins for the frontend.",
  "project_state.json": "Contains the project’s current version, architectural notes, known issues, and existing feature definitions for a browser-based hacking game. Used to track build planning, backend/frontend integration issues, and pending fixes for solo and multiplayer modes."
}