{
  "backend/main.mo": "Defines game backend types and logic including profiles, lobbies, matches, challenges, authorization, and creation of solo/multiplayer lobbies.",
  "feature_evidence.json": "Lists feature evidence records linking features to frontend files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries for many frontend files describing styling, routing, components, and gameplay-related pages.",
  "frontend/index.css": "Tailwind base stylesheet defining color variables, dark mode values, and global background/foreground styles.",
  "frontend/index.html": "Minimal HTML shell that loads the React app via main.tsx.",
  "frontend/public/google79d2180f87c8c2c7.html": "Google site verification file for domain ownership.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes for all pages and wraps the app in a themed layout.",
  "frontend/src/components/auth/LoginButton.tsx": "Internet Identity login/logout button with loading states and query cache clearing.",
  "frontend/src/components/auth/ProfileSetupModal.tsx": "Modal prompting authenticated users without a profile to set their display name and save it to backend.",
  "frontend/src/components/game/RoundTimer.tsx": "Countdown timer component showing minutes and seconds with urgency coloring.",
  "frontend/src/components/game/Scoreboard.tsx": "Displays players in a lobby with host labeling using terminal-styled UI.",
  "frontend/src/components/game/TerminalPanel.tsx": "Implements an interactive terminal UI with command history, autocomplete, and scrolling output for challenge processing.",
  "frontend/src/components/layout/AppLayout.tsx": "Provides the main app layout with header navigation, footer, and versioned branding wrapper around page content.",
  "frontend/src/constants/appVersion.ts": "Exports the single application version constant.",
  "frontend/src/content/updates.ts": "Defines the changelog entries for the Updates page with version metadata and change lists.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor tied to Internet Identity, invalidating related queries when the actor changes.",
  "frontend/src/hooks/useActorReady.ts": "Wraps useActor to expose a simple readiness flag for when the backend actor is usable.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, loading, login, and logout handling via AuthClient.",
  "frontend/src/hooks/useLobbyAutoJoin.ts": "Coordinates automatic and manual joining of multiplayer lobbies, tracking attempts, errors, and join state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for backend operations including profiles, lobbies, matches, and terminal command processing.",
  "frontend/src/index.css": "Tailwind setup defining a cyber‑terminal theme, custom color variables, and CRT-style UI utility classes.",
  "frontend/src/main.tsx": "App entry point that initializes React, React Query, Internet Identity, and loads the root App component.",
  "frontend/src/pages/HomePage.tsx": "Landing page with solo/multiplayer actions, lobby creation, authentication checks, and terminal‑style UI.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays global leaderboard and recent matches with authentication notice and loading states.",
  "frontend/src/pages/LobbyPage.tsx": "Manages lobby state, auto‑join, start/leave actions, and navigation into active matches.",
  "frontend/src/pages/MatchPage.tsx": "Runs the active match with terminal commands, challenge updates, auto‑join handling, and completion flow.",
  "frontend/src/pages/ResultsPage.tsx": "Shows final score, mode, and navigation options after a match concludes.",
  "frontend/src/pages/SoloGamePage.tsx": "React page that initializes and manages a solo game session, including lobby creation, match start, polling for readiness, and error handling.",
  "frontend/src/pages/UpdatesPage.tsx": "Displays a styled changelog page showing versioned updates pulled from static content.",
  "frontend/src/utils/parseIcError.ts": "Converts various IC and backend errors into user-friendly messages with specific handling for common failure cases.",
  "frontend/src/utils/soloInitProgress.ts": "Defines solo initialization phases, timeout logic, and helper messages for progress display.",
  "frontend/src/utils/soloReadiness.ts": "Utilities for determining solo lobby readiness and retrying with exponential backoff and cancellable delays.",
  "frontend/src/utils/unwrapCandidOptional.ts": "Unwraps Candid optional values, returning the underlying value or null.",
  "frontend/src/utils/urlParams.ts": "Provides helpers for reading, storing, and clearing URL parameters with session persistence and hash routing support.",
  "frontend/tailwind.config.js": "Tailwind configuration with custom colors, animations, typography, and plugin setup.",
  "project_state.json": "Tracks project schema, current state version, goals for a browser-based hacking game, architectural notes, known issues, and feature definitions. Serves as a centralized reference for build planning and troubleshooting."
}