{
  "kind": "build_request",
  "title": "Further tighten Solo Mode startup latency and loading UX",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-54",
      "text": "Reduce perceived and actual Solo startup latency by tightening the Solo readiness fallback path so the UI reaches the playable terminal state with fewer delays when `startMatchAndGetLobby` returns a lobby that is not yet ready (active + non-null currentChallenge). This includes tuning the bounded retry/backoff delays used by Solo readiness polling to favor faster early retries while remaining within the overall Solo init timeout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-1"
        ],
        "quotes": [
          "yes plz",
          "Version 17 is live — can you try Solo again and see if the loading feels any quicker now? If it still hesitates, I can tighten it further."
        ]
      },
      "acceptanceCriteria": [
        "When navigating to /solo, if `startMatchAndGetLobby` returns a lobby that is not ready, the subsequent readiness polling attempts occur with tighter early delays than the current default (100ms, 200ms, 400ms, ...), improving time-to-ready in common transient-delay cases.",
        "The readiness polling remains bounded (no infinite loops) and respects the overall Solo initialization timeout (currently defined in `frontend/src/utils/soloInitProgress.ts`).",
        "Solo Mode still transitions to `INITIALIZATION_FAILED` with Retry/Back controls if the lobby never becomes ready within the configured bounds/timeout."
      ]
    },
    {
      "id": "REQ-55",
      "text": "Improve the Solo initialization loading UX messaging so progress feels more responsive during slower startups: display phase-specific English progress text and include elapsed time during `INITIALIZING_SOLO_MODE` to reassure users the game is still working while polling for readiness.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-1"
        ],
        "quotes": [
          "yes plz",
          "see if the loading feels any quicker now"
        ]
      },
      "acceptanceCriteria": [
        "During Solo initialization (loading state), the UI shows the current phase message (creating/starting/loading) and also shows elapsed time since initialization started in clear English (e.g., \"Elapsed: 3 seconds\").",
        "The elapsed-time display updates while initialization is in progress and disappears once the terminal is ready or the error state is shown.",
        "All user-facing text added/changed for this improvement is in English."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under `frontend/src/components/ui` (read-only Shadcn components).",
    "Do not modify immutable hook entrypoints listed in SYSTEM_CONTEXT (e.g., `frontend/src/hooks/useActor.ts`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/main.tsx`)."
  ],
  "nonGoals": [
    "Do not change backend canister APIs or Motoko logic as part of this request.",
    "Do not add new gameplay features, challenges, or multiplayer changes."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}