{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize Solo Mode initialization and align terminal command processing with typed backend API",
  "requirements": [
    {
      "id": "REQ-32",
      "summary": "Harden Solo Mode initialization flow to reliably reach TerminalPanel or show the existing initialization error panel with actionable English messaging.",
      "acceptanceCriteria": [
        "Navigating to /solo reliably reaches the playable terminal view (TerminalPanel rendered) or shows the existing \"INITIALIZATION_FAILED\" panel with a clear English error message and Retry/Back controls.",
        "If createLobby or startMatch fails, SoloGamePage transitions to the error panel and does not remain in the loading state.",
        "If polling for currentChallenge exceeds the max attempts, SoloGamePage shows the existing error panel with an actionable English message (no silent failure or infinite loading)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SoloGamePage.tsx",
          "operation": "modify",
          "description": "Refactor Solo Mode initialization into a cancellation-safe, non-recursive polling loop that always resolves to either \"ready\" (TerminalPanel renders) or \"error\" (INITIALIZATION_FAILED panel). Ensure createLobby/startMatch failures are caught at the top-level and set initState='error' with a clear English message from parseIcErrorToMessage, and ensure polling timeout/max-attempt failure sets a specific actionable English error message and clears any pending timers."
        },
        {
          "path": "frontend/src/utils/parseIcError.ts",
          "operation": "modify",
          "description": "Expand error-to-message mapping to cover common Solo Mode initialization failures (e.g., lobby created but missing/empty state, transient fetch failures) so SoloGamePage shows clear, actionable English errors instead of vague/technical text."
        }
      ]
    },
    {
      "id": "REQ-34",
      "summary": "Update useProcessCommand to call the typed backend command-processing method only (no any-based detection or simulation fallback) and surface failures as clear English terminal output in SoloGamePage and MatchPage.",
      "acceptanceCriteria": [
        "`frontend/src/hooks/useQueries.ts` no longer contains a local `simulateCommandProcessing` fallback for gameplay; it always calls the backend method when the actor is available.",
        "If the backend rejects/throws on processCommand, the user sees a clear English error message in the terminal output (and MatchPage retains its error panel behavior).",
        "No TypeScript `any` is required to access `processCommand` on the actor."
      ],
      "file_operations": [
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align the generated backend typings used by the frontend with the intended typed command-processing method by adding/updating a `processCommand(lobbyId, commandText)` signature returning a structured output compatible with TerminalPanel (typed lines with type/text, solved boolean, optional context). Update/remove the old terminal command method typing if necessary to eliminate the need for `any` in hooks."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Remove `simulateCommandProcessing` and the `any`-based method detection. Update `useProcessCommand` to call the typed actor method `processCommand(lobbyId, commandText)` directly and normalize the returned value to the existing `CommandOutput` shape expected by TerminalPanel. Ensure errors are thrown as `Error` with a clear English message (preferably using parseIcErrorToMessage) so pages can surface them consistently."
        },
        {
          "path": "frontend/src/pages/SoloGamePage.tsx",
          "operation": "modify",
          "description": "Ensure command-processing failures (from useProcessCommand calling the backend) are converted into user-visible terminal error lines with clear English text (using parseIcErrorToMessage), and avoid any unhandled promise rejections that could keep the UI in a stuck state."
        },
        {
          "path": "frontend/src/pages/MatchPage.tsx",
          "operation": "modify",
          "description": "Keep MatchPage's existing command error panel behavior while ensuring backend command-processing failures also return an error line in terminal output with a clear English message (using parseIcErrorToMessage) and do not rely on any `any`-typed actor access."
        }
      ]
    }
  ]
}