{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Improve Solo Mode startup UX and resilient readiness polling",
  "requirements": [
    {
      "id": "REQ-48",
      "summary": "Keep Solo Mode in a clear loading/progress state during slower initialization and only fail after an explicit longer timeout with Retry/Back controls.",
      "acceptanceCriteria": [
        "When navigating to /solo on a healthy but slow backend, the page stays in a loading state and does not immediately enter INITIALIZATION_FAILED with the “server may be slow” message.",
        "Solo initialization only transitions to the error panel after an explicit longer timeout window (not after the current short polling window), and the error panel still includes RETRY and BACK_TO_MENU.",
        "User-facing loading text is in English and clearly indicates that the game is still connecting/loading (without blaming the user)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SoloGamePage.tsx",
          "operation": "modify",
          "description": "Revise Solo initialization state handling to use explicit phase-based progress messaging (e.g., creating lobby, starting match, waiting for challenge) and introduce a longer, explicit overall timeout before transitioning to INITIALIZATION_FAILED. Ensure the failure view remains the existing error panel with RETRY and BACK_TO_MENU, and ensure the “server may be slow…” messaging is only shown after the longer timeout rather than after the short initial polling window."
        },
        {
          "path": "frontend/src/utils/soloInitProgress.ts",
          "operation": "create",
          "description": "Add a small utility to support Solo initialization UX needs (e.g., consistent progress phase labels, elapsed-time formatting, and/or timeout helpers) so SoloGamePage can present clear English progress updates while waiting without prematurely failing."
        }
      ]
    },
    {
      "id": "REQ-49",
      "summary": "Optimize Solo readiness checks: immediately accept ready lobbies from startMatchAndGetLobby; otherwise use bounded retries/backoff that favors quick success while tolerating transient delays without early failure.",
      "acceptanceCriteria": [
        "If startMatchAndGetLobby returns an active lobby with a present currentChallenge, SoloGamePage transitions to the ready terminal view without performing additional getLobby polling.",
        "If the initial returned lobby is not ready, subsequent retries/polling use a bounded strategy that is less likely to fail within ~1 second solely due to transient latency.",
        "The terminal view renders once lobby.isActive is true and currentChallenge is present (correctly handling Candid optionals), without flashing an error state in between."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SoloGamePage.tsx",
          "operation": "modify",
          "description": "Update the readiness logic to: (1) short-circuit to READY immediately when the lobby returned by startMatchAndGetLobby isActive and has a present currentChallenge; (2) when not ready, replace the current 5x200ms polling with a bounded retry strategy (fast initial checks followed by backoff) that does not fail within ~1 second and does not transition through an error state while still within the explicit longer timeout window; (3) centralize and harden currentChallenge presence checks to correctly handle Candid optional encodings without UI flashing."
        },
        {
          "path": "frontend/src/utils/soloReadiness.ts",
          "operation": "create",
          "description": "Implement a reusable Solo readiness helper (e.g., isLobbyReady + bounded retry/backoff scheduler) that encapsulates the ‘isActive && currentChallenge present’ condition and provides a resilient polling plan for SoloGamePage to use."
        }
      ]
    }
  ]
}