{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Tighten Solo startup latency and improve Solo loading progress UX",
  "requirements": [
    {
      "id": "REQ-54",
      "summary": "Tighten Solo readiness fallback polling (faster early retries) while remaining bounded and within the Solo init timeout.",
      "acceptanceCriteria": [
        "When navigating to /solo, if `startMatchAndGetLobby` returns a lobby that is not ready, the subsequent readiness polling attempts occur with tighter early delays than the current default (100ms, 200ms, 400ms, ...), improving time-to-ready in common transient-delay cases.",
        "The readiness polling remains bounded (no infinite loops) and respects the overall Solo initialization timeout (currently defined in `frontend/src/utils/soloInitProgress.ts`).",
        "Solo Mode still transitions to `INITIALIZATION_FAILED` with Retry/Back controls if the lobby never becomes ready within the configured bounds/timeout."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/soloReadiness.ts",
          "operation": "modify",
          "description": "Adjust the Solo readiness retry/backoff strategy to favor faster early retries (e.g., smaller initial delays and/or a tighter early schedule) while staying bounded; also correct the retry-delay calculation so attempt #1 maps to the intended initial delay (avoid skipping the first interval)."
        },
        {
          "path": "frontend/src/pages/SoloGamePage.tsx",
          "operation": "modify",
          "description": "Wire the updated readiness polling configuration into the Solo fallback path (used when `startMatchAndGetLobby` returns a not-ready lobby), ensuring the polling loop remains bounded and continues to respect the overall Solo init timeout check before/within waits."
        }
      ]
    },
    {
      "id": "REQ-55",
      "summary": "Add phase-specific Solo initialization progress messaging with an updating elapsed-time display during initialization.",
      "acceptanceCriteria": [
        "During Solo initialization (loading state), the UI shows the current phase message (creating/starting/loading) and also shows elapsed time since initialization started in clear English (e.g., \"Elapsed: 3 seconds\").",
        "The elapsed-time display updates while initialization is in progress and disappears once the terminal is ready or the error state is shown.",
        "All user-facing text added/changed for this improvement is in English."
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/SoloGamePage.tsx",
          "operation": "modify",
          "description": "Add an initialization-only elapsed-time UI line under the phase message (English text), backed by a timer that updates while `initState === 'initializing'`, and ensure it stops/clears when transitioning to ready or error so the elapsed-time display disappears in terminal/error states."
        },
        {
          "path": "frontend/src/utils/soloInitProgress.ts",
          "operation": "modify",
          "description": "Extend/adjust existing elapsed-time formatting helpers as needed to support clear English elapsed-time display (e.g., producing \"3 seconds\"), keeping the Solo init timeout constant and referenced by the Solo initialization flow."
        }
      ]
    }
  ]
}